Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties.ExtendedClashCheck Property
 Defines whether the extended clash check is used.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ExtendedClashCheck { get; set; }
Public Property ExtendedClashCheck As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisModelGeneralProperties Class
Tekla.Structures.Analysis Namespace